init.el
;; Font size of system
(defvar gunner/default-font-size 120)
(defvar gunner/default-variable-font-size 120)

;; Make frame transparency overridable
(defvar gunner/frame-transparency '(100 . 100))

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun gunner/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))
;; (defun gunner/eshell-at-startup()
;;   (eshell))
(add-hook 'emacs-startup-hook #'gunner/display-startup-time)
;; (add-hook 'emacs-startup-hook #'gunner/eshell-at-startup)
(add-hook 'html-mode-hook #'(lambda nil (setq sgml-xml-mode t)))

;; Initialize package sources
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq straight-use-package-by-default t)
(setq package-enable-at-startup nil)

(straight-use-package 'use-package)
(straight-use-package 'vertico)
(straight-use-package 'consult)
(straight-use-package 'marginalia)
(straight-use-package 'evil)
(straight-use-package 'openwith)
(straight-use-package 'orderless)
(straight-use-package 'savehist)
(straight-use-package 'which-key)
(straight-use-package 'all-the-icons)
(straight-use-package 'all-the-icons-completion)
(straight-use-package 'doom-modeline)
(straight-use-package 'doom-themes)
(straight-use-package 'modus-themes)
(straight-use-package 'embark)
(straight-use-package 'embark-consult)
(straight-use-package 'undo-tree)
(straight-use-package 'helpful)
(straight-use-package 'hydra)
(straight-use-package 'lsp-mode)
(straight-use-package 'lsp-treemacs)
(straight-use-package 'dap-mode)
(straight-use-package 'pyvenv)
(straight-use-package 'django-mode)
(straight-use-package 'django-snippets)
(straight-use-package 'lsp-pyright)
(straight-use-package 'omnisharp-mode)
(straight-use-package 'omnisharp)
(straight-use-package 'company)
(straight-use-package 'company-box)
(straight-use-package 'projectile)
(straight-use-package 'consult-projectile)
(straight-use-package 'magit)
(straight-use-package 'forge)
(straight-use-package 'emmet-mode)
(straight-use-package 'skewer-mode)
(straight-use-package 'impatient-mode)
(straight-use-package 'minions)
(straight-use-package 'diminish)
(straight-use-package 'winum)
(straight-use-package 'yasnippet-snippets)
(straight-use-package 'dabbrev)
(straight-use-package 'ripgrep)
(straight-use-package 'rg)
(straight-use-package 'dart-mode)
(straight-use-package 'lsp-dart)
(straight-use-package 'projectile-ripgrep)
(straight-use-package 'htmlize)

;; (server-start)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)           ; Disable tooltips
(set-fringe-mode 10)        ; Give some breathing room
(menu-bar-mode -1)            ; Disable the menu bar

(global-undo-tree-mode)      ; Enable undo tree mode

;; Set up the visible bell
(setq visible-bell t)

(column-number-mode)
(global-display-line-numbers-mode t)

;; Set frame transparency
(set-frame-parameter (selected-frame) 'alpha gunner/frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,gunner/frame-transparency))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))


;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                vterm-mode-hook
                mu4e-mode-hook
                nov-mode-hook
                elfeed-show-mode-hook
                elfeed-search-mode-hook
                telega-chat-mode-hook
                telega-root-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq display-line-numbers-type 'relative)
(setenv "PATH" (concat (getenv "PATH") ":/home/ural/.local/bin"))

;; (add-hook 'eshell-mode-hook 'eshell-mode-hook-func)

;; NOTE: If you want to move everything out of the ~/.emacs.d folder
;; reliably, set `user-emacs-directory` before loading no-littering!
                                        ;(setq user-emacs-directory "~/.cache/emacs")

;; keep customization in temporary folder
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)
(use-package no-littering
  :straight t)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(set-face-attribute 'default nil :font "Hack" :height gunner/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Hack" :height gunner/default-font-size)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height gunner/default-variable-font-size :weight 'regular)
