Emacs.org
** Evil 
This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.  [[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

#+begin_src emacs-lisp

   ;; Make ESC quit prompts
   (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
   (global-set-key (kbd "C-e") 'move-end-of-line)


   (use-package evil
     :init
     (setq evil-want-integration t)
     (setq evil-want-keybinding nil)
     (setq evil-want-C-u-scroll t)
     (setq evil-want-C-i-jump nil)
     (setq evil-respect-visual-line-mode t)
     (setq forge-add-default-bindings nil)
     ;;(evil-set-undo-system 'undo-tree)
     :config
     (evil-mode 1)
     (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
     ;; (define-key evil-insert-state-map (kbd "C-f") 'evil-forward-char)
     ;; (define-key evil-insert-state-map (kbd "C-b") 'evil-backward-char)
     (define-key evil-insert-state-map (kbd "C-a") 'evil-beginning-of-line)
     ;; (define-key evil-insert-state-map (kbd "C-e") 'evil-end-of-line)
     (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

     ;; Use visual line motions even outside of visual-line-mode buffers
     (evil-global-set-key 'motion "j" 'evil-next-visual-line)
     (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

     (evil-set-initial-state 'messages-buffer-mode 'normal)
     (evil-set-initial-state 'dashboard-mode 'normal))

   (use-package evil-collection
     :after evil
     :config
     (evil-collection-init))

#+end_src

*** Emacs equivalents of o and O
#+begin_src emacs-lisp

  (defun vi-open-line-above ()
    "Insert a newline above the current line and put point at beginning."
    (interactive)
    (unless (bolp)
      (beginning-of-line))
    (newline)
    (forward-line -1)
    (indent-according-to-mode))

  (defun vi-open-line-below ()
    "Insert a newline below the current line and put point at beginning."
    (interactive)
    (unless (eolp)
      (end-of-line))
    (newline-and-indent))

  (defun vi-open-line (&optional abovep)
    "Insert a newline below the current line and put point at beginning.
    With a prefix argument, insert a newline above the current line."
    (interactive "P")
    (if abovep
        (vi-open-line-above)
      (vi-open-line-below)))

  (define-key global-map (kbd "C-c o") 'vi-open-line-below)
  (define-key global-map (kbd "C-c O") 'vi-open-line-above)

#+end_src

*** Evil Surrond
This package emulates surround.vim by Tim Pope. The functionality is wrapped into a minor mode.

#+begin_src emacs-lisp
  (use-package evil-surround
    :straight t
    :config
    (global-evil-surround-mode 1))
#+end_src

*** Evil replace with register
#+begin_src emacs-lisp
  (use-package evil-replace-with-register
    :config
    (setq evil-replace-with-register-key (kbd "gr"))
    (evil-replace-with-register-install)
    )
#+end_src

** General
#+begin_src emacs-lisp

  (use-package general
    :after evil
    :config
    (general-create-definer gunner/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "M-SPC")

    (gunner/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tl" '(consult-theme :which-key "choose theme")
      "td" '(disable-theme :which-key "disable existing theme")
      "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org"))))) 

#+end_src

* UI Configuration

** Color Theme
*** Doom Themes
#+begin_src emacs-lisp

  ;; (use-package doom-themes
  ;;   :straight t
  ;;   :config
  ;;   ;; Global settings (defaults)
  ;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
  ;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;;   ;; (load-theme 'doom-gruvbox t)

  ;;   ;; Enable flashing mode-line on errors
  ;;   (doom-themes-visual-bell-config)
  ;;   ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;;   (doom-themes-neotree-config)
  ;;   ;; or for treemacs users
  ;;   (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;;   (doom-themes-treemacs-config)
  ;;   ;; Corrects (and improves) org-mode's native fontification.
  ;;   (doom-themes-org-config))

#+end_src
