Emacs.org
** Better Modeline

#+begin_src emacs-lisp

  (use-package all-the-icons)
  (use-package minions
    :hook (doom-modeline-mode . minions-mode))
  (use-package diminish)
  (use-package doom-modeline
    :init (doom-modeline-mode nil)
    :hook (after-init . doom-modeline-init)
    :custom-face
    (mode-line ((t (:height 0.85))))
    (mode-line-inactive ((t (:height 0.85))))
    :custom 
    (doom-modeline-height 15)
    (doom-modeline-bar-width 6)
    (doom-modeline-lsp t)
    ;; (doom-modeline-github nil)
    ;; (doom-modeline-mu4e nil)
    ;; (doom-modeline-irc nil)
    (doom-modeline-minor-modes t)
    (doom-modeline-persp-name nil)
    (doom-modeline-buffer-file-name-style 'truncate-except-project)
    (doom-modeline-major-mode-icon nil))
#+end_src

#+RESULTS:
| doom-modeline-init | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |

** Vertico
#+begin_src emacs-lisp
  (defun gunner/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent
  folder, otherwise delete a character backward"
    (interactive "p")
    (if minibuffer-completing-file-name
        ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
        (if (string-match-p "/." (minibuffer-contents))
            (zap-up-to-char (- arg) ?/)
          (delete-minibuffer-contents))
      (delete-backward-char arg)))

  (use-package vertico
    :init
    (vertico-mode)
    :bind (:map minibuffer-local-map
                ("<backspace>" . gunner/minibuffer-backward-kill))
    :custom
    (vertico-cycle t)
    (vertico-resize t)
    :config
    (with-eval-after-load 'evil
      (define-key vertico-map (kbd "M-TAB") 'vertico-exit-input)
      (define-key vertico-map (kbd "C-j") 'vertico-next)
      (define-key vertico-map (kbd "C-k") 'vertico-previous)
      (define-key vertico-map (kbd "M-h") 'vertico-directory-up))
    )

#+end_src

** Savehist and Orderles
#+begin_src emacs-lisp

    ;;; Orderless
  (use-package orderless
    :init
    (setq completion-styles '(orderless partial-completion)
          orderless-smart-case t
          completion-category-overrides nil
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion)))))


    ;;; Savehist
  (use-package savehist
    :init
    (savehist-mode))

#+end_src

** Marginalia
#+begin_src emacs-lisp

  (use-package marginalia
    :init
    (marginalia-mode)
    :custom
    (marginalia-align 'right)
    :config
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    )


  ;; All-the-icon-completion
  (use-package all-the-icons-completion
    :after (marginalia all-the-icons)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
    :init
    (all-the-icons-completion-mode))

#+end_src

** Consult
#+begin_src emacs-lisp

  (defun gunner/get-project-root()
    (when (fboundp 'projectile-project-root)
      (projectile-projecct-root)))

  (use-package consult
    :bind
    (("C-M-j" . consult-buffer)
     ("C-M-k" . consult-imenu)
     ("C-s" . consult-line)
     :map minibuffer-local-map
     ("C-r" . consult-history))
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :custom
    (consult-project-root-function #'gunner/get-project-root)
    (completion-in-region-function #'consult-completion-in-region)
    )

#+end_src

** Embark
#+begin_src emacs-lisp
  (use-package embark
    :straight t
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C->" . embark-act)
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command))

  ;;Embark Which Key indicator

  (defun embark-which-key-indicator ()
    "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
    (lambda (&optional keymap targets prefix)
      (if (null keymap)
          (which-key--hide-popup-ignore-command)
        (which-key--show-keymap
         (if (eq (plist-get (car targets) :type) 'embark-become)
             "Become"
           (format "Act on %s '%s'%s"
                   (plist-get (car targets) :type)
                   (embark--truncate-target (plist-get (car targets) :target))
                   (if (cdr targets) "…" "")))
         (if prefix
             (pcase (lookup-key keymap prefix 'accept-default)
               ((and (pred keymapp) km) km)
               (_ (key-binding prefix 'accept-default)))
           keymap)
         nil nil t (lambda (binding)
                     (not (string-suffix-p "-argument" (cdr binding))))))))

  (setq embark-indicators
        '(embark-which-key-indicator
          embark-highlight-indicator
          embark-isearch-highlight-indicator))

  (defun embark-hide-which-key-indicator (fn &rest args)
    "Hide the which-key indicator immediately when using the completing-read prompter."
    (which-key--hide-popup-ignore-command)
    (let ((embark-indicators
           (remq #'embark-which-key-indicator embark-indicators)))
      (apply fn args)))

  (advice-add #'embark-completing-read-prompter
              :around #'embark-hide-which-key-indicator)

#+end_src
** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :init
    (setq which-key-use-C-h-commands nil) ;; disable C-h which key help
    :defer 0
    :config
    (define-key which-key-mode-map (kbd "C-x <f5>") 'which-key-C-h-dispatch) ;;  remaped C-h to f5
    (which-key-mode)
    (setq which-key-idle-delay 1))
#+end_src
** Helpful Help Commands

#+begin_src emacs-lisp

  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)
  (global-set-key (kbd "C-h F") #'helpful-function)
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)
  (global-set-key (kbd "C-h C") #'helpful-command)

#+end_src

** Transpose Frame
#+begin_src emacs-lisp
  (use-package transpose-frame
    :defer t)
#+end_src

* Emojis in bufffers 
#+begin_src emacs-lisp
  (use-package emojify
    :hook (erc-mode . emojify-mode)
    :commands emojify-mode
    :straight t
    :config
    )
#+end_src

#+RESULTS:
| emojify-mode | doom-modeline-set-special-modeline |

* Hydra
** Initialization
#+begin_src emacs-lisp
  (use-package hydra
    :defer t)
#+end_src

#+RESULTS:
** Hydra Windows Navigation
#+begin_src emacs-lisp
  (defhydra hydra-windows-nav (:color red)
    ("s" shrink-window-horizontally "shrink horizontally" :column "Sizing")
    ("d" evil-window-decrease-height "shrink vertically")
    ("e" enlarge-window-horizontally "enlarge horizontally")
    ("a" evil-window-increase-height "enlarge vertically")
    ("b" balance-windows "balance window height")
    ("m" maximize-window "maximize current window")
    ("M" minimize-window "minimize current window")

    ("H" split-window-below "split horizontally" :column "Split management")
    ("v" split-window-right "split vertically")
    ("c" delete-window "delete current window")
    ("o" delete-other-windows "delete-other-windows")

    ("z" ace-window "ace window" :color blue :column "Navigation")
    ("h" windmove-left "← window")
    ("j" windmove-down "↓ window")
    ("k" windmove-up "↑ window")
    ("l" windmove-right "→ window")

    ("B" transpose-frame "transpose-frame" :column "Transpose")
    ("V" flip-frame "Flip verticaly")
    ("F" flop-frame "Flip horizontally")
    ("S" rotate-frame "Rotate 180 degrees")
    ("U" rotate-frame-clockwise "Rotate 90 degrees clockwise")
    ("P" rotate-frame-anticlockwise "Rotate 90 degrees ant-clockwise")

    ("u" winner-undo "Winner undo" :column "Windmove")
    ("r" winner-redo "Winner redo")
    ("q" nil "quit menu" :color blue :column nil))

  (gunner/leader-keys
    "w" '(hydra-windows-nav/body :which-key "Windows Navigation"))
#+end_src
** Text Scaling
#+begin_src emacs-lisp
  (defhydra hydra-scale-text (:color red)
    ("j" text-scale-increase "increase" :column "Text Scale")
    ("k" text-scale-decrease "decrease")
    ("q" nil "quit menu" :color blue :column nil))

  (gunner/leader-keys
    "s" '(hydra-scale-text/body :which-key "Text Scaling"))
#+end_src
