Emacs.org
*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp

  (defun gunner/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . gunner/org-mode-visual-fill))

#+end_src

** Better Font Faces

The =gunner/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp

  (defun gunner/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src
** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing  followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type  and press =TAB= to expand into such a block.


#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("cl" . "src c"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src
** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =gunner/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun gunner/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'gunner/org-babel-tangle-config)))

#+end_src

**  Org Mode hacks
*** Org Screenshots
#+begin_src emacs-lisp
  (defun my-org-screenshot ()
    "Take a screenshot into a time stamped unique-named file in the
  same directory as the org-buffer and insert a link to this file."
    (interactive)
    (setq filename
          (concat
           (make-temp-name
            (concat (buffer-file-name)
                    "_"
                    (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))
    (call-process "import" nil nil nil filename)
    (insert (concat "[[" filename "]]"))
    (org-display-inline-images))
#+end_src
*** Org download
#+begin_src emacs-lisp
  (use-package org-download
    :hook (dired-mode-hook . org-download-enable))
#+end_src

** Org-Pomodoro
#+begin_src emacs-lisp
  (use-package org-pomodoro
    :straight t
    :commands (org-pomodoro)
    :config
    (setq
     org-pomodoro-length 25
     org-pomodoro-short-break-length 5
     org-pomodoro-start-sound-p nil
     org-pomodoro-finished-sound-p nil
     org-pomodoro-clock-break t)
    (setq alert-user-configuration (quote ((((:category . "org-pomodoro")) libnotify nil)))))
#+end_src

* Org Roam
#+begin_src emacs-lisp
  (use-package org-roam
    :straight t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Documents/RoamNotes")
    (org-roam-completion-everywhere t)
    (org-roam-capture-templates
     '(("d" "default" plain
        "%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i" . completion-at-point))
    :config
    (org-roam-setup))
#+end_src

* Org Tree Slide

**  Initial Setup

#+begin_src emacs-lisp

  (use-package org-tree-slide
    :custom (org-image-actual-width nil))

#+end_src

** Customization
#+begin_src emacs-lisp
      (use-package hide-mode-line)

      (defun gunner/presentation-setup ()
        ;; Hide the mode line
        (hide-mode-line-mode 1)

        ;; Display images inline
        (org-display-inline-images) ;; Can also use org-startup-with-inline-images

        ;; Scale the text.  The next line is for basic scaling:
        (setq text-scale-mode-amount 3)
        (text-scale-mode 1))

      ;; This option is more advanced, allows you to scale other faces too
      ;; (setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)
      ;;                                    (org-verbatim (:height 1.75) org-verbatim)
      ;;                                    (org-block (:height 1.25) org-block))))

      (defun gunner/presentation-end ()
        ;; Show the mode line again
        (hide-mode-line-mode 0)

        ;; Turn off text scale mode (or use the next line if you didn't use text-scale-mode)
        ;; (text-scale-mode 0)

        ;; If you use face-remapping-alist, this clears the scaling:
        (setq-local face-remapping-alist '((default variable-pitch default))))

      (use-package org-tree-slide
        :hook ((org-tree-slide-play . gunner/presentation-setup)
               (org-tree-slide-stop . gunner/presentation-end))
        :custom
        (org-tree-slide-slide-in-effect t)
        (org-tree-slide-activate-message "Presentation started!")
        (org-tree-slide-deactivate-message "Presentation finished!")
        (org-tree-slide-header t)
        (org-tree-slide-breadcrumbs " > ")
        (org-image-actual-width nil))
#+end_src

#+RESULTS:
| gunner/presentation-end | efs/presentation-end |

* Org Reveal
#+begin_src emacs-lisp
  (use-package ox-reveal
    :config
    (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))
#+end_src

#+RESULTS:
: t

