Emacs.org
* Pomidor
#+begin_src emacs-lisp
  (use-package pomidor
    :straight t
    :bind (("<f12>" . pomidor))
    :config
    (setq pomidor-sound-tick nil
          pomidor-sound-tack nil)
    (setq alert-default-style 'libnotify)
    (setq pomidor-seconds (* 25 60)) ; 25 minutes for the work period
    (setq pomidor-break-seconds (* 5 60)) ; 5 minutes break time
    (setq pomidor-breaks-before-long 4) ; wait 4 short breaks before long break
    (setq pomidor-long-break-seconds (* 20 60)) ; 20 minutes long break time
    :hook (pomidor-mode . (lambda ()
                            (display-line-numbers-mode -1) ; Emacs 26.1+
                            (setq left-fringe-width 0 right-fringe-width 0)
                            (setq left-margin-width 2 right-margin-width 0)
                            ;; force fringe update
                            (set-window-buffer nil (current-buffer)))))
#+end_src
* Development 

** lsp-mode
#+begin_src emacs-lisp
    (defun gunner/lsp-mode-setup ()
      (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
      (lsp-headerline-breadcrumb-mode))

    (use-package lsp-mode
      :custom
      (lsp-completion-provider :none) ;; we use Corfu!

      :commands (lsp lsp-deferred)

      :hook
      (lsp-completion-mode . my/lsp-mode-setup-completion)
      (lsp-mode . gunner/lsp-mode-setup)
      (sh-mode . lsp)
      (css-mode . lsp)
      (dart-mode . lsp)
      (csharp-mode . lsp)
      :init
      (defun my/orderless-dispatch-flex-first (_pattern index _total)
        (and (eq index 0) 'orderless-flex))

      (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'

      (defun my/lsp-mode-setup-completion ()
        (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
              '(orderless))) ;; Configure orderless

      ;; Optionally configure the first word as flex filtered.
      (add-hook 'orderless-style-dispatchers #'my/orderless-dispatch-flex-first nil 'local)

      ;; Optionally configure the cape-capf-buster.
      (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point)))

      :config
      (lsp-enable-which-key-integration t)
      )
#+end_src

#+RESULTS:
| gunner/lsp-mode-setup |

** lsp-ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src

#+RESULTS:
| lsp-ui-mode | gunner/lsp-mode-setup |

** lsp-treemacs
#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp)
#+end_src

#+RESULTS:

** consult-lsp 
#+begin_src emacs-lisp
  (use-package consult-lsp)
#+end_src

** Debugging with dap-mode
#+begin_src emacs-lisp

  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
    :commands dap-debug
    :config
    ;; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
     :keymaps 'lsp-mode-map
     :prefix lsp-keymap-prefix
     "d" '(dap-hydra t :wk "debugger")))


#+end_src

#+RESULTS:
: t

** Python
#+begin_src emacs-lisp

  (use-package python-mode
    :straight t
    ;; :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python)
    )

  (gunner/leader-keys
    "l"  '(:ignore t :which-key "Python Shell Send")
    "lf" '(python-shell-send-file :which-key "Python Shell Send File")
    "ld" '(python-shell-send-defun :which-key "Python Shell Send Defun")
    "lb" '(python-shell-send-buffer :which-key "Python Shell Send Buffer")
    "lr" '(python-shell-send-region :which-key "python shell Send Region"))

  (use-package pyvenv
    :after python-mode
    :config
    (pyvenv-mode 1))
  ;; (use-package lsp-jedi
  ;;   :ensure t
  ;;   :config
  ;;   (with-eval-after-load "lsp-mode"
  ;;     (add-to-list 'lsp-disabled-clients 'pyls)
  ;;     (add-to-list 'lsp-enabled-clients 'jedi)))



#+end_src

#+RESULTS:
: t

** Django
#+begin_src emacs-lisp
  (use-package django-mode
    :straight t
    :defer 40)

  (use-package djangonaut
    :straight t
    :defer 42)
#+end_src

** lsp-pyright
#+begin_src emacs-lisp
  (use-package lsp-pyright
    :straight t
    :after python-mode
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp)))  ; or lsp-deferred
    :config
    (with-eval-after-load "lsp-mode"
      (add-to-list 'lsp-disabled-clients 'pyls)))


  (add-hook 'python-mode-hook
            (lambda ()
              (setq flycheck-python-pylint-executable "/usr/bin/pylint")
              (setq flycheck-pylintrc "/home/ural/.config/pylintrc")))


#+end_src

#+RESULTS:
| (lambda nil (require 'lsp-pyright) (lsp)) | evil-collection-python-set-evil-shift-width | doom-modeline-env-setup-python |

** yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :config
    (setq yas-snippet-dirs '("~/.emacs.d/snippets/" "~/.emacs.d/straight/repos/yasnippet-snippets/snippets/"))
    (yas-global-mode 1))
#+end_src

#+RESULTS:
: t

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    ;; :custom ((projectile-completion-system 'default))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired)
    :config (projectile-mode)
    (gunner/leader-keys
      "pf" 'consult-projectile-find-file
      "ps" 'consult-projectile-switch-project
      "pF" 'consult-ripgrep 
      "pl" 'consult-lsp-symbols 
      "pb" 'consult-projectile-switch-to-buffer
      "pc" 'projectile-compile-project
      "pd" 'projectile-dired
      "pd" 'consult-projectile-find-dir
      "pr" 'projectile-run-project
      "pv" 'projectile-run-vterm))

  (use-package consult-projectile
    :hook
    (marginalia-mode . consult-projectile))
#+end_src

#+RESULTS:
: t

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; optional: this is the evil state that evil-magit will use
  ;; (setq evil-magit-state 'normal)
  ;; optional: disable additional bindings for yanking text
  ;; (setq evil-magit-use-y-for-yank nil)
  ;; (require 'evil-magit)

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge
    :straight t
    :init
    (setq forge-add-default-bindings nil))
#+end_src

#+RESULTS:

** Smart and Show Paren Mode
#+begin_src emacs-lisp
  (show-paren-mode 1)
  (use-package smartparens-config
    :straight smartparens
    :hook
    (emacs-lisp-mode . smartparens-mode)
    (lsp-mode . smartparens-mode)
    (org-mode . smartparens-mode)
    :config
    (sp-with-modes 'org-mode
      (sp-local-pair "=" "=" :wrap "C-=")))

  (use-package evil-smartparens
    :straight t
    :after smartparens
    :hook
    (smartparens-enabled-hook . evil-smartparens-mode)
    )
#+end_src

** Html Mode
#+begin_src emacs-lisp
  (add-hook 'html-mode-hook 'lsp)
  (add-hook 'html-mode-hook 'skewer-html-mode)
#+end_src

** Emmet for web development
#+begin_src emacs-lisp
  (add-hook 'sgml-mode-hook 'emmet-mode) 
  (add-hook 'html-mode-hook 'emmet-mode)
  (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.

#+end_src

** Livedown for live preview
#+begin_src emacs-lisp
  ;; (add-to-list 'load-path (expand-file-name "~/.emacs.d/emacs-livedown"))
  ;; (require 'livedown)
#+end_src

** Lua Mode
#+begin_src emacs-lisp
  (use-package lua-mode
    :straight t
    :hook (lsp . lua-mode)
    :mode ("\\.lua\\'" . lua-mode)
    :interpreter ("lua" . lua-mode)
    )
#+end_src

** C/C++ Mode
#+begin_src emacs-lisp
(add-hook 'c-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)
#+end_src

