init.el

;; Assuming usage with dart-mode
(use-package dart-mode
  :custom
  (dart-sdk-path (concat (getenv "HOME") "/flutter/bin/cache/dark-sdk/")
   dart-format-on-save t))

(use-package hover
  :straight  t
  :after dart-mode
  :bind (:map hover-minor-mode-map
              ("C-M-z" . #'hover-run-or-hot-reload)
              ("C-M-x" . #'hover-run-or-hot-restart)
              ("C-M-p" . #'hover-take-screenshot))
  :init
  (setq hover-flutter-sdk-path (concat (getenv "HOME") "/flutter") ; remove if `flutter` is already in $PATH
        hover-command-path (concat (getenv "GOPATH") "/bin/hover") ; remove if `hover` is already in $PATH
        hover-hot-reload-on-save t
        hover-screenshot-path (concat (getenv "HOME") "/Pictures")
        hover-screenshot-prefix "my-prefix-"
        hover-observatory-uri "http://my-custom-host:50300"
        hover-clear-buffer-on-hot-restart t)
  (hover-minor-mode 1))

(use-package dumb-jump
  :straight t)

(defhydra hydra-dumb-jump (:color pink :columns 3)
  "Dumb Jump"
  ("g" dumb-jump-go "Go")
  ("o" dumb-jump-go-other-window "Other window")
  ("b" dumb-jump-back "Back")
  ("l" dumb-jump-quick-look "Look")
  ("e" dumb-jump-go-prefer-external "External")
  ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
  ("q" nil "Quit" :color blue))

(gunner/leader-keys
  "d" '(hydra-dumb-jump/body :which-key "Dumb Jump"))

(use-package hideshow
  :hook ((prog-mode . hs-minor-mode)))

(defun toggle-fold ()
  (interactive)
  (save-excursion
    (end-of-line)
    (hs-toggle-hiding)))

(use-package flyspell-correct
  :bind ("C-M-," . flyspell-correct-at-point)
  ("C-M-q" . flyspell-auto-correct-word )
  :config
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))
  (dolist (hook '(change-log-mode-hook log-edit-mode-hook))
    (add-hook hook (lambda () (flyspell-mode -1))))
  ;; find aspell and hunspell automatically
  (cond
   ((executable-find "aspell")
    (setq ispell-program-name "aspell")
    (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")))
   ((executable-find "hunspell")
    (setq ispell-program-name "hunspell")
    (setq ispell-extra-args '("-d en_US")))
   ))

(use-package consult-flyspell
  :straight (consult-flyspell :type git :host gitlab :repo "OlMon/consult-flyspell" :branch "master")
  :config
  ;; default settings
  (setq consult-flyspell-select-function nil
        consult-flyspell-set-point-after-word t
        consult-flyspell-correct-function 'flyspell-correct-at-point
        consult-flyspell-always-check-buffer nil))

(use-package dictionary
  :straight t)

(use-package mw-thesaurus
  :straight t
  :defer t
  :config
  (setq mw-thesaurus--api-key "67d977d5-790b-412e-a547-9dbcc2bcd525")
  (add-hook 'mw-thesaurus-mode-hook (lambda () (define-key evil-normal-state-local-map (kbd "q") 'mw-thesaurus--quit)))
  )

(use-package powerthesaurus
  :straight t)

(use-package winum
  :bind (:map winum-keymap
              ("C-~" . winum-select-window-by-number)
              ("C-²" . winum-select-window-by-number)
              ("M-9" . winum-select-window-0-or-10)
              ("M-1" . winum-select-window-1)
              ("M-2" . winum-select-window-2)
              ("M-3" . winum-select-window-3)
              ("M-4" . winum-select-window-4)
              ("M-5" . winum-select-window-5)
              ("M-6" . winum-select-window-6)
              ("M-7" . winum-select-window-7)
              ("M-8" . winum-select-window-8))
  :init
  (winum-mode))

(winner-mode)

(straight-use-package 'emms)
(use-package emms
  :config
  (require 'emms-setup)
  (require 'emms-player-mpd)
  (setq emms-player-list '(emms-player-mpd))
  (add-to-list 'emms-info-functions 'emms-info-mpd)
  (add-to-list 'emms-player-list 'emms-player-mpd)

  ;; Socket is not supported
  (setq emms-player-mpd-server-name "localhost")
  (setq emms-player-mpd-server-port "6600")
  (setq emms-player-mpd-music-directory "/data/music")
  (emms-all)
  (emms-default-players))

(setq emms-source-file-default-directory (expand-file-name "~/Music/"))

(setq emms-player-mpd-server-name "localhost")
(setq emms-player-mpd-server-port "6600")
(setq emms-player-mpd-music-directory "~/Music")
(add-to-list 'emms-info-functions 'emms-info-mpd)
(add-to-list 'emms-player-list 'emms-player-mpd)
(emms-player-mpd-connect)

(setq emms-info-asynchronously nil)
(setq emms-playlist-buffer-name "*Music*")

(use-package lyrics-fetcher
  :straight t
  :after (emms)
  :config
  (setq lyrics-fetcher-genius-access-token "23O2v8mDgs8O7bbKTmYXV-RUbmxXkCkxuDKD-W7CSkqIXreOXedNk3yaZ_LSpj74"))
