Emacs.org
* ERC Configuration
#+begin_src emacs-lisp
  (setq erc-server "irc.libera.chat"
        erc-nick "uralgunners"
        erc-user-full-name "Ural Shrestha"
        erc-track-shorten-start 8
        erc-autojoin-channels-alist '(("irc-libera.chat" "#systemcrafters" "##soccers"))
        erc-kill-buffer-on-part t
        erc-auto-query 'bury)
#+end_src

#+RESULTS:
: bury

* Elfeed
** Elfeed Syncing and Writing
#+begin_src emacs-lisp
  ;;functions to support syncing .elfeed between machines
  ;;makes sure elfeed reads index from disk before launching
  (defun bjm/elfeed-load-db-and-open ()
    "Wrapper to load the elfeed db from disk before opening"
    (interactive)
    (elfeed)
    (elfeed-db-load)
    (elfeed-goodies/setup)
    (elfeed-search-update--force)
    (elfeed-update))

  ;;write to disk when quiting
  (defun bjm/elfeed-save-db-and-bury ()
    "Wrapper to save the elfeed db to disk before burying buffer"
    (interactive)
    (elfeed-db-save)
    (quit-window))
#+end_src
** Elfeed Youtube
#+begin_src emacs-lisp
  (defun yt-dl-it (url)
    "Downloads the URL in an async shell"
    (let ((default-directory "~/Videos"))
      (async-shell-command (format "youtube-dl %s" url))))

  (defun mpv-it (url)
    "Play the URL in an async shell"
    (let ((default-directory "~/Videos"))
      (async-shell-command (format "mpv %s" url))))

  (defun elfeed-youtube-dl (&optional use-generic-p)
    "Youtube-DL link"
    (interactive "P")
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               do (elfeed-untag entry 'unread)
               when (elfeed-entry-link entry)
               do (yt-dl-it it))
      (mapc #'elfeed-search-update-entry entries)
      (unless (use-region-p) (forward-line))))

  (defun elfeed-mpv (&optional use-generic-p)
    "mpv link"
    (interactive "P")
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               do (elfeed-untag entry 'unread)
               when (elfeed-entry-link entry)
               do (mpv-it it))
      (mapc #'elfeed-search-update-entry entries)
      (unless (use-region-p) (forward-line))))

  ;; (define-key elfeed-search-mode-map (kbd "d") 'elfeed-youtube-dl)
  ;; (define-key elfeed-search-mode-map (kbd "D") 'elfeed-mpv)
#+end_src
** Elfeed Initialization
#+begin_src emacs-lisp
  (setq elfeed-db-directory "~/Dropbox/elfeeddb")
  (use-package elfeed
    :straight t
    :commands (elfeed)
    :bind (:map elfeed-search-mode-map
                ("q" . bjm/elfeed-save-db-and-bury)
                ("Q" . bjm/elfeed-save-db-and-bury))
    :config
    (setq elfeed-search-feed-face ":foreground #fff :weight bold")
    )
#+end_src

** Elfeed Org
#+begin_src emacs-lisp
  (use-package elfeed-org
    :after (elfeed)
    :straight t
    :config
    (elfeed-org)
    (setq rmh-elfeed-org-files (list "~/Dropbox/elfeed.org")))
#+end_src

** Elfeed Goodies
#+begin_src emacs-lisp
  (use-package elfeed-goodies
    :straight t
    :hook (elfeed-show-mode-hook . visual-line-mode)
    :config
    (elfeed-goodies/setup)
    (setq elfeed-goodies/entry-pane-size 0.8)
    (setq elfeed-goodies/entry-pane-position 'top)
    (evil-define-key 'normal elfeed-show-mode-map
      (kbd "J") 'elfeed-goodies/split-show-next
      (kbd "K") 'elfeed-goodies/split-show-prev)
    (evil-define-key 'normal elfeed-search-mode-map
      (kbd "J") 'elfeed-goodies/split-show-next
      (kbd "K") 'elfeed-goodies/split-show-prev)
    (setq elfeed-goodies/search-header '((:left  ((:feed-name . 9)
                                                  (:tags . 12)
                                                  (:entry-title . 20))
                                                 :right ((:filter . 0)
                                                         (:status . 0)
                                                         )
                                                 )))
    ;; (setq elfeed-goodies/search-header '((:feed-name) (:tags) (:entry-title)
    ;;                                      (:empty . :fill)
    ;;                                      (:filter) (:status) (:db-date)))
    )
#+end_src

* Engine Mode
#+begin_src emacs-lisp

  (setq browse-url-generic-program (executable-find "firefox")
        browse-url-browser-function 'browse-url-generic
        browse-url-generic-args '("-private-window"))
  (use-package engine-mode
    :init
    (engine-mode t)
    :config
    (engine/set-keymap-prefix (kbd "C-x e"))

    ;; Search Engine
    (defengine duckduckgo
      "https://duckduckgo.com/?q=%s"
      :keybinding "d")

    (defengine github
      "https://github.com/search?ref=simplesearch&q=%s"
      :keybinding "g")

    (defengine google-maps
      "http://maps.google.com/maps?q=%s"
      :docstring "Mappin' it up."
      :keybinding "m")

    (defengine project-gutenberg
      "http://www.gutenberg.org/ebooks/search/?query=%s"
      :keybinding "b")

    (defengine stack-overflow
      "https://stackoverflow.com/search?q=%s"
      :keybinding "s")

    (defengine youtube
      "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
      :keybinding "y")

    (defengine wolfram-alpha
      "http://www.wolframalpha.com/input/?i=%s"
      :keybinding "x")

    (defengine twitter
      "https://twitter.com/search?q=%s"
      :keybinding "t")

    (defengine archwiki
      "https://wiki.archlinux.org/?search=%s"
      :keybinding "a")

    (defengine urbandictionary
      "https://www.urbandictionary.com/define.php?term=%s"
      :keybinding "u")

    (defengine invidious
      "https://invidious.flokinet.to/search?q=%s"
      :keybinding "i")

    (defengine wikipedia
      "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
      :keybinding "w"
      :docstring "Searchin' the wikis.")
    )
#+end_src
* File Management

** Dired

*** Key Bindings

**** Navigation

*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

**** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

**** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

**** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

**** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

**** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

*** Configuration

#+begin_src emacs-lisp

  (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :commands (dired dired-jump))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "nsxiv")
                                  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src

#+RESULTS:
| doom-modeline-set-project-modeline | dired-hide-dotfiles-mode | dired-extra-startup | all-the-icons-dired-mode |

* Applications

** Some App

This is an example of configuring another non-Emacs application using org-mode.  Not only do we write out the configuration at =.config/some-app/config=, we also compute the value that gets stored in this configuration from the Emacs Lisp block above it.

#+NAME: the-value
#+begin_src emacs-lisp :tangle no

  (+ 55 100)

#+end_src

*NOTE*: Set the =:tangle= parameter below to =.config/some-app/config= for this to work!

#+begin_src conf :tangle no :noweb yes

  value=<<the-value()>>

#+end_src

* Runtime Performance

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp

  ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src
