init.el

(setq erc-server "irc.libera.chat"
      erc-nick "uralgunners"
      erc-user-full-name "Ural Shrestha"
      erc-track-shorten-start 8
      erc-autojoin-channels-alist '(("irc-libera.chat" "#systemcrafters" "##soccers"))
      erc-kill-buffer-on-part t
      erc-auto-query 'bury)

;;functions to support syncing .elfeed between machines
;;makes sure elfeed reads index from disk before launching
(defun bjm/elfeed-load-db-and-open ()
  "Wrapper to load the elfeed db from disk before opening"
  (interactive)
  (elfeed)
  (elfeed-db-load)
  (elfeed-goodies/setup)
  (elfeed-search-update--force)
  (elfeed-update))

;;write to disk when quiting
(defun bjm/elfeed-save-db-and-bury ()
  "Wrapper to save the elfeed db to disk before burying buffer"
  (interactive)
  (elfeed-db-save)
  (quit-window))

(defun yt-dl-it (url)
  "Downloads the URL in an async shell"
  (let ((default-directory "~/Videos"))
    (async-shell-command (format "youtube-dl %s" url))))

(defun mpv-it (url)
  "Play the URL in an async shell"
  (let ((default-directory "~/Videos"))
    (async-shell-command (format "mpv %s" url))))

(defun elfeed-youtube-dl (&optional use-generic-p)
  "Youtube-DL link"
  (interactive "P")
  (let ((entries (elfeed-search-selected)))
    (cl-loop for entry in entries
             do (elfeed-untag entry 'unread)
             when (elfeed-entry-link entry)
             do (yt-dl-it it))
    (mapc #'elfeed-search-update-entry entries)
    (unless (use-region-p) (forward-line))))

(defun elfeed-mpv (&optional use-generic-p)
  "mpv link"
  (interactive "P")
  (let ((entries (elfeed-search-selected)))
    (cl-loop for entry in entries
             do (elfeed-untag entry 'unread)
             when (elfeed-entry-link entry)
             do (mpv-it it))
    (mapc #'elfeed-search-update-entry entries)
    (unless (use-region-p) (forward-line))))

;; (define-key elfeed-search-mode-map (kbd "d") 'elfeed-youtube-dl)
;; (define-key elfeed-search-mode-map (kbd "D") 'elfeed-mpv)

(setq elfeed-db-directory "~/Dropbox/elfeeddb")
(use-package elfeed
  :straight t
  :commands (elfeed)
  :bind (:map elfeed-search-mode-map
              ("q" . bjm/elfeed-save-db-and-bury)
              ("Q" . bjm/elfeed-save-db-and-bury))
  :config
  (setq elfeed-search-feed-face ":foreground #fff :weight bold")
  )

(use-package elfeed-org
  :after (elfeed)
  :straight t
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files (list "~/Dropbox/elfeed.org")))

(use-package elfeed-goodies
  :straight t
  :hook (elfeed-show-mode-hook . visual-line-mode)
  :config
  (elfeed-goodies/setup)
  (setq elfeed-goodies/entry-pane-size 0.8)
  (setq elfeed-goodies/entry-pane-position 'top)
  (evil-define-key 'normal elfeed-show-mode-map
    (kbd "J") 'elfeed-goodies/split-show-next
    (kbd "K") 'elfeed-goodies/split-show-prev)
  (evil-define-key 'normal elfeed-search-mode-map
    (kbd "J") 'elfeed-goodies/split-show-next
    (kbd "K") 'elfeed-goodies/split-show-prev)
  (setq elfeed-goodies/search-header '((:left  ((:feed-name . 9)
                                                (:tags . 12)
                                                (:entry-title . 20))
                                               :right ((:filter . 0)
                                                       (:status . 0)
                                                       )
                                               )))
  ;; (setq elfeed-goodies/search-header '((:feed-name) (:tags) (:entry-title)
  ;;                                      (:empty . :fill)
  ;;                                      (:filter) (:status) (:db-date)))
  )

(setq browse-url-generic-program (executable-find "firefox")
      browse-url-browser-function 'browse-url-generic
      browse-url-generic-args '("-private-window"))
(use-package engine-mode
  :init
  (engine-mode t)
  :config
  (engine/set-keymap-prefix (kbd "C-x e"))

  ;; Search Engine
  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")

  (defengine google-maps
    "http://maps.google.com/maps?q=%s"
    :docstring "Mappin' it up."
    :keybinding "m")

  (defengine project-gutenberg
    "http://www.gutenberg.org/ebooks/search/?query=%s"
    :keybinding "b")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine youtube
    "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
    :keybinding "y")

  (defengine wolfram-alpha
    "http://www.wolframalpha.com/input/?i=%s"
    :keybinding "x")

  (defengine twitter
    "https://twitter.com/search?q=%s"
    :keybinding "t")

  (defengine archwiki
    "https://wiki.archlinux.org/?search=%s"
    :keybinding "a")

  (defengine urbandictionary
    "https://www.urbandictionary.com/define.php?term=%s"
    :keybinding "u")

  (defengine invidious
    "https://invidious.flokinet.to/search?q=%s"
    :keybinding "i")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w"
    :docstring "Searchin' the wikis.")
  )

(use-package dired
  :straight nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))

(use-package dired-single
  :commands (dired dired-jump))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :commands (dired dired-jump)
  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  (setq dired-open-extensions '(("png" . "nsxiv")
                                ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
